{
  "backend/main.mo": "Main backend actor implementing access control, user profiles, video/channel/course management, membership tiers, subscriptions, playlists, donations, comments, and Stripe integration with blob storage for media files.",
  "backend/migration.mo": "Data migration module defining OldActor and NewActor types to handle schema evolution, adding viewCount field to videos during upgrades.",
  "feature_evidence.json": "Feature evidence report documenting three implemented features: video settings editor, course settings editor, and personalized course recommendations with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components, pages, and hooks including video/course editing, personalized recommendations, authentication, channel management, and Stripe integration.",
  "frontend/index.html": "HTML entry point for the Video Sharing Platform MVP with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring QueryClient, ThemeProvider, AuthProvider, and TanStack Router with routes for all pages including upload, watch, channel, courses, playlists, and payment flows.",
  "frontend/src/components/AddToPlaylistDialog.tsx": "Dialog component allowing users to add videos to existing playlists or create new playlists with title, description, and visibility settings.",
  "frontend/src/components/CategoryFilter.tsx": "Renders a horizontal scrollable list of category filter buttons (All, Music, Gaming, Education, Vlog, Comedy, Other) with active state styling.",
  "frontend/src/components/CourseCard.tsx": "Displays a course card with title, description, video count, and access requirements (free, tier-locked, or paid), with appropriate action buttons for starting or purchasing the course.",
  "frontend/src/components/CreateChannelDialog.tsx": "Modal dialog for creating a new channel with name and description fields, generating a unique channel ID and associating it with the authenticated user's principal.",
  "frontend/src/components/CreateCourseDialog.tsx": "Modal dialog for creating a course with title, description, pricing/tier options, and video selection from the channel's existing videos.",
  "frontend/src/components/DonateDialog.tsx": "Modal dialog for making one-time donations to a channel with preset amounts, custom amount input, and optional message field.",
  "frontend/src/components/DonationsFeed.tsx": "Displays a feed of the 10 most recent donations to a channel, showing donor avatar, name, amount, message, and timestamp with loading and empty states.",
  "frontend/src/components/EditChannelDialog.tsx": "Modal dialog for editing an existing channel's name and profile description, pre-populated with current channel data.",
  "frontend/src/components/EditCourseDialog.tsx": "Dialog component for editing course details including title, description, price, membership tier requirements, video selection, visibility, and course image upload with progress tracking.",
  "frontend/src/components/EditStripeAccountDialog.tsx": "Dialog component for creating or updating Stripe account configurations with fields for account name, secret key, connect ID, and payout settings, including secret key visibility toggle.",
  "frontend/src/components/EditVideoDialog.tsx": "Dialog component for editing video metadata including title, description, category, privacy settings, membership tier requirements, and thumbnail upload with progress tracking.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying copyright notice and attribution to caffeine.ai with a heart icon.",
  "frontend/src/components/Header.tsx": "Main navigation header with logo, search functionality, authentication controls, and dropdown menu for user profile, subscriptions, liked videos, courses, and settings.",
  "frontend/src/components/Layout.tsx": "Root layout component that wraps the application with Header and Footer, displaying a loading spinner during authentication initialization.",
  "frontend/src/components/MembershipTiersSection.tsx": "Displays channel membership tiers in a grid with pricing, descriptions, and subscription buttons, showing current tier status and access levels for authenticated users.",
  "frontend/src/components/PersonalizedCoursesSection.tsx": "Displays personalized course recommendations based on user activity, showing different states for unauthenticated users, loading, empty results, and populated course cards with navigation to course playback.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that prompts authenticated users without a profile to enter their name for initial profile creation, blocking further interaction until completed.",
  "frontend/src/components/ProtectedRoute.tsx": "Route wrapper that redirects unauthenticated users and shows a loading spinner during auth initialization before rendering protected content.",
  "frontend/src/components/StripeAccountsList.tsx": "Manages display and CRUD operations for user Stripe accounts, showing connection status badges and providing dialogs for creating, editing, and deleting payment accounts.",
  "frontend/src/components/StripeConfigurationSetup.tsx": "Admin-only modal that appears when Stripe is not configured, allowing platform administrators to set the Stripe secret key and allowed countries for payment processing.",
  "frontend/src/components/VideoCard.tsx": "Displays a video thumbnail with metadata including title, channel info, views, upload time, and badges for private/members-only content and category.",
  "frontend/src/components/VideoCardWithActions.tsx": "Extended video card component that adds edit and delete action buttons with confirmation dialogs for video management by channel owners.",
  "frontend/src/contexts/AuthContext.tsx": "Provides authentication context using Internet Identity, managing auth status (initializing/authenticated/unauthenticated), identity, and login/logout functions.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor with proper identity, initializes access control on authentication, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication provider and hook, managing AuthClient lifecycle, identity persistence, login flow, and delegation validation.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations including user profiles, videos, channels, subscriptions, courses, playlists, donations, and Stripe integration.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom CSS variables for light/dark themes, including colors for UI components, charts, and sidebar elements.",
  "frontend/src/main.tsx": "Application entry point that sets up QueryClient, InternetIdentityProvider, and renders the root App component.",
  "frontend/src/pages/ChannelAnalyticsPage.tsx": "Displays channel analytics dashboard with metrics for subscribers, monthly revenue, donations, and membership tiers, restricted to channel owners.",
  "frontend/src/pages/ChannelPage.tsx": "Main channel page showing videos, courses, membership tiers, and donations with follow/unfollow functionality and owner-specific actions like settings and upload.",
  "frontend/src/pages/ChannelSettingsPage.tsx": "Channel settings page for owners to manage membership tiers, Stripe account connections, and tier CRUD operations with dialogs for creating/editing/deleting tiers.",
  "frontend/src/pages/CourseManagementPage.tsx": "Course management page for channel owners to view, create, and edit courses with dialogs for course CRUD operations.",
  "frontend/src/pages/CoursePlayerPage.tsx": "Course player page displaying course details with edit functionality for channel owners.",
  "frontend/src/pages/FollowingPage.tsx": "Protected page showing a grid of channels the authenticated user follows with links to view each channel.",
  "frontend/src/pages/HomePage.tsx": "Main landing page displaying personalized courses section, category filter, and a grid of all videos with loading and error states.",
  "frontend/src/pages/MyChannelsPage.tsx": "Protected page listing user's owned channels with create channel dialog and links to manage each channel.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Payment cancellation page showing failure message for subscriptions or donations with navigation back to channel or home.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Displays a success confirmation page after payment completion, showing different messages for subscriptions vs donations and providing navigation buttons back to the channel or home page.",
  "frontend/src/pages/PlaylistEditPage.tsx": "Provides a page for editing playlist details, fetching playlist data by ID and displaying loading/error states with a basic card layout showing playlist title and description.",
  "frontend/src/pages/PlaylistPlayerPage.tsx": "Implements a playlist video player with sequential playback controls (next/previous/shuffle/repeat), displaying the current video alongside a scrollable list of all playlist videos.",
  "frontend/src/pages/PlaylistsPage.tsx": "Displays the authenticated user's playlists in a list view, showing playlist titles and video counts with loading states and empty state messaging.",
  "frontend/src/pages/ProfileSettingsPage.tsx": "Protected page allowing users to update their profile name and view their principal ID, with form validation and integration with StripeAccountsList component for payment account management.",
  "frontend/src/pages/SearchPage.tsx": "Displays search results for videos based on query parameters, showing a grid of video cards with loading skeletons and empty state messaging when no results are found.",
  "frontend/src/pages/SubscriptionsPage.tsx": "Shows the user's active channel subscriptions/memberships with authentication check, currently displaying an empty state placeholder for future subscription management features.",
  "frontend/src/pages/UploadPage.tsx": "Provides a video upload form for channel owners with fields for title, description, category, video/thumbnail files, and optional membership tier restrictions, including authorization checks and validation.",
  "frontend/src/pages/WatchPage.tsx": "Video watch page component that displays video player, channel info, like/share buttons, comments section, and handles video access control based on subscription tiers. Includes edit functionality for video owners via EditVideoDialog.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom color schemes using OKLCH color space, container settings, border radius variables, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state tracking file documenting a video learning platform with three main features: video settings editor, course settings editor, and personalized course recommendations based on user activity."
}